Repository: giellalt/corpus-fin
Catalog: tmx/sme/facta/giellatekno/vasta.fin.html.tmx
Source language: fin
Languages: sme

source: Vasta-ohjelmassa sinun on tarkoitus antaa vastauksia sattumanvaraisiin kysymyksiin.
sme: Vasta-prográmmas galgá vástidit jearaldagaide mat bohtet soaittáhagas.

source: Harjoituksen tarkoituksena on harjoitella verbien ja nominien taivutusta.
sme: Ulbmil lea hárjehallat vearbasojaheami ja kásusgeavaheami.

source: Ohjelma hyväksyy useita vastausvaihtoehtoja ja antaa kommentteja mahdollisiin virheisiin.
sme: Prográmma dohkkeha eanet vástádusaid, ja kommentere erenoamážit meattáhusaid vearbasojaheamis ja kásusgeavaheamis.

source: Ohjelma edellyttää, että vastaus annetaan kokonaisena ​​lauseena (lauseessa on oltava finiittiverbi). Jos kysymyksessä on me-pronomini, sinun pitää vastata pronominilla " te ".
sme: Prográmma gáibida ahte vástida olles cealkagiin (galgá leat finihtta vearba), ja jus prográmma jearrá " mii " - pronomeniin, de don galggat vástidit " " - pronomeniin.

source: Sama pätee myös, jos kysymyksessä on " te " - pronomini.
sme: Seammáládje " moai " ja " doai " - vaikko lunddolaš ságastallamis sáhtášit dulkot earáládje.

source: Tavoitteena on harjoitella verbien taivutusta monipuolisesti subjekti-verbi-yhdistelmien avulla
sme: Sivva lea ahte mii háliidit ahte geavaheaddjit fertejit hárjehallat buot persovdnasojahemiid.

source: Vasta-ohjelmassa on kaksi vaihtoehtoa: Vasta-S ja Vasta-F:
sme: Leat guokte versuvnna, Vasta-S ja Vasta-F:

source: Vasta-S: Ohjelma antaa sinulle muutaman sanan, joita sinun pitää käyttää vastauksessasi.
sme: Vasta-S: Don oaččut muhtun sániid maid galggat geavahit vástádusas.

source: Sinun pitää taivuttaa siniset sanat oikein.
sme: Alit sániid fertet sojahit.

source: Voit valita montako sinistä sanaa haluat ohjelman antavan sinulle.
sme: Don sáhtát válljet galle alit sáni don háliidat.

source: Ohjelmassa on seuraavat vaikeusasteet:
sme: Prográmmas leat dát dásit:

source: Taso 1: Vain preesens ja yksinkertainen sijakäyttö.
sme: Dássi 1: Dušše preseansa ja álkes kásusgeavaheapmi.

source: Tasot 1-2: Kysymykset tulevat myös preteritissä, vastauslauseessa voi olla monta verbiä sekä lauseenjäseniä, joissa on lukusanoja ja / tai demonstratiivipronomineja.
sme: Dásit 1-2: Jearaldagat maiddái preterihtas, cealkagat main leat máŋga vearbba ja cealkalahtut main leat logut ja čujuheaddji pronomenat.

source: Vasta-F: Voit muotoilla vastauksesi vapaasti.
sme: Vasta-F: Sáhttá ieš mearridit vástádusa.

source: Taso 1: Verbit vain preesensissä ja sijamuotojen peruskäyttö, lähinnä yksikössä.
sme: Dássi 1: Dušše preseansa ja álkes kásusgeavaheapmi, eanaš ovttaidlogus.

source: Taso 1-2: Verbejä myös preteritissä ja enemmän monikkomuotoja, sekä lisäksi adverbiaalisijamuotoja.
sme: Dásit 1-2: Vearbbat maid preterihtas, eanet kásusat máŋggaidlogus ja dasa lassin vearbbat mat gáibidit dihto kásusa.

source: Taso 1-3: Lukusanojen sijataivutus, kollektiiviset luvut, verbien konditionaalimuotoja.
sme: Dásit 1-3: Lohkosánit sojahuvvon kásusiid mielde, čoahkkelogut, vearbbat konditionalis.

source: Otamme mielellään vastaan kommentteja ohjelmasta: (oahpa@uit.no).
sme: Sáddes áinnas kommentáraid prográmmii midjiide: (oahpa@uit.no).
